app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "species", "color", "image_url", "age_in_months", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

UPDATE "pets" SET "description" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["description", "Loves people."], ["updated_at", "2017-09-09 14:48:42.785243"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @pet.update(pet_params)